###############################################################
#  Generated by:      Cadence Innovus 20.10-p004_1
#  OS:                Linux x86_64(Host ID EEX052)
#  Generated on:      Mon May 30 17:05:47 2022
#  Design:            bk_32bit
#  Command:           routeDesign -globalDetail
###############################################################
current_design bk_32bit
create_clock  -name clk -period 10.000000 -waveform {0.000000 5.000000}
set_input_transition 0.1  [get_ports {a[31]}]
set_input_transition 0.1  [get_ports {a[30]}]
set_input_transition 0.1  [get_ports {a[29]}]
set_input_transition 0.1  [get_ports {a[28]}]
set_input_transition 0.1  [get_ports {a[27]}]
set_input_transition 0.1  [get_ports {a[26]}]
set_input_transition 0.1  [get_ports {a[25]}]
set_input_transition 0.1  [get_ports {a[24]}]
set_input_transition 0.1  [get_ports {a[23]}]
set_input_transition 0.1  [get_ports {a[22]}]
set_input_transition 0.1  [get_ports {a[21]}]
set_input_transition 0.1  [get_ports {a[20]}]
set_input_transition 0.1  [get_ports {a[19]}]
set_input_transition 0.1  [get_ports {a[18]}]
set_input_transition 0.1  [get_ports {a[17]}]
set_input_transition 0.1  [get_ports {a[16]}]
set_input_transition 0.1  [get_ports {a[15]}]
set_input_transition 0.1  [get_ports {a[14]}]
set_input_transition 0.1  [get_ports {a[13]}]
set_input_transition 0.1  [get_ports {a[12]}]
set_input_transition 0.1  [get_ports {a[11]}]
set_input_transition 0.1  [get_ports {a[10]}]
set_input_transition 0.1  [get_ports {a[9]}]
set_input_transition 0.1  [get_ports {a[8]}]
set_input_transition 0.1  [get_ports {a[7]}]
set_input_transition 0.1  [get_ports {a[6]}]
set_input_transition 0.1  [get_ports {a[5]}]
set_input_transition 0.1  [get_ports {a[4]}]
set_input_transition 0.1  [get_ports {a[3]}]
set_input_transition 0.1  [get_ports {a[2]}]
set_input_transition 0.1  [get_ports {a[1]}]
set_input_transition 0.1  [get_ports {a[0]}]
set_input_transition 0.1  [get_ports {b[31]}]
set_input_transition 0.1  [get_ports {b[30]}]
set_input_transition 0.1  [get_ports {b[29]}]
set_input_transition 0.1  [get_ports {b[28]}]
set_input_transition 0.1  [get_ports {b[27]}]
set_input_transition 0.1  [get_ports {b[26]}]
set_input_transition 0.1  [get_ports {b[25]}]
set_input_transition 0.1  [get_ports {b[24]}]
set_input_transition 0.1  [get_ports {b[23]}]
set_input_transition 0.1  [get_ports {b[22]}]
set_input_transition 0.1  [get_ports {b[21]}]
set_input_transition 0.1  [get_ports {b[20]}]
set_input_transition 0.1  [get_ports {b[19]}]
set_input_transition 0.1  [get_ports {b[18]}]
set_input_transition 0.1  [get_ports {b[17]}]
set_input_transition 0.1  [get_ports {b[16]}]
set_input_transition 0.1  [get_ports {b[15]}]
set_input_transition 0.1  [get_ports {b[14]}]
set_input_transition 0.1  [get_ports {b[13]}]
set_input_transition 0.1  [get_ports {b[12]}]
set_input_transition 0.1  [get_ports {b[11]}]
set_input_transition 0.1  [get_ports {b[10]}]
set_input_transition 0.1  [get_ports {b[9]}]
set_input_transition 0.1  [get_ports {b[8]}]
set_input_transition 0.1  [get_ports {b[7]}]
set_input_transition 0.1  [get_ports {b[6]}]
set_input_transition 0.1  [get_ports {b[5]}]
set_input_transition 0.1  [get_ports {b[4]}]
set_input_transition 0.1  [get_ports {b[3]}]
set_input_transition 0.1  [get_ports {b[2]}]
set_input_transition 0.1  [get_ports {b[1]}]
set_input_transition 0.1  [get_ports {b[0]}]
set_input_transition 0.1  [get_ports {cin}]
set_load -pin_load -max  1  [get_ports {sum[31]}]
set_load -pin_load -min  1  [get_ports {sum[31]}]
set_load -pin_load -max  1  [get_ports {sum[30]}]
set_load -pin_load -min  1  [get_ports {sum[30]}]
set_load -pin_load -max  1  [get_ports {sum[29]}]
set_load -pin_load -min  1  [get_ports {sum[29]}]
set_load -pin_load -max  1  [get_ports {sum[28]}]
set_load -pin_load -min  1  [get_ports {sum[28]}]
set_load -pin_load -max  1  [get_ports {sum[27]}]
set_load -pin_load -min  1  [get_ports {sum[27]}]
set_load -pin_load -max  1  [get_ports {sum[26]}]
set_load -pin_load -min  1  [get_ports {sum[26]}]
set_load -pin_load -max  1  [get_ports {sum[25]}]
set_load -pin_load -min  1  [get_ports {sum[25]}]
set_load -pin_load -max  1  [get_ports {sum[24]}]
set_load -pin_load -min  1  [get_ports {sum[24]}]
set_load -pin_load -max  1  [get_ports {sum[23]}]
set_load -pin_load -min  1  [get_ports {sum[23]}]
set_load -pin_load -max  1  [get_ports {sum[22]}]
set_load -pin_load -min  1  [get_ports {sum[22]}]
set_load -pin_load -max  1  [get_ports {sum[21]}]
set_load -pin_load -min  1  [get_ports {sum[21]}]
set_load -pin_load -max  1  [get_ports {sum[20]}]
set_load -pin_load -min  1  [get_ports {sum[20]}]
set_load -pin_load -max  1  [get_ports {sum[19]}]
set_load -pin_load -min  1  [get_ports {sum[19]}]
set_load -pin_load -max  1  [get_ports {sum[18]}]
set_load -pin_load -min  1  [get_ports {sum[18]}]
set_load -pin_load -max  1  [get_ports {sum[17]}]
set_load -pin_load -min  1  [get_ports {sum[17]}]
set_load -pin_load -max  1  [get_ports {sum[16]}]
set_load -pin_load -min  1  [get_ports {sum[16]}]
set_load -pin_load -max  1  [get_ports {sum[15]}]
set_load -pin_load -min  1  [get_ports {sum[15]}]
set_load -pin_load -max  1  [get_ports {sum[14]}]
set_load -pin_load -min  1  [get_ports {sum[14]}]
set_load -pin_load -max  1  [get_ports {sum[13]}]
set_load -pin_load -min  1  [get_ports {sum[13]}]
set_load -pin_load -max  1  [get_ports {sum[12]}]
set_load -pin_load -min  1  [get_ports {sum[12]}]
set_load -pin_load -max  1  [get_ports {sum[11]}]
set_load -pin_load -min  1  [get_ports {sum[11]}]
set_load -pin_load -max  1  [get_ports {sum[10]}]
set_load -pin_load -min  1  [get_ports {sum[10]}]
set_load -pin_load -max  1  [get_ports {sum[9]}]
set_load -pin_load -min  1  [get_ports {sum[9]}]
set_load -pin_load -max  1  [get_ports {sum[8]}]
set_load -pin_load -min  1  [get_ports {sum[8]}]
set_load -pin_load -max  1  [get_ports {sum[7]}]
set_load -pin_load -min  1  [get_ports {sum[7]}]
set_load -pin_load -max  1  [get_ports {sum[6]}]
set_load -pin_load -min  1  [get_ports {sum[6]}]
set_load -pin_load -max  1  [get_ports {sum[5]}]
set_load -pin_load -min  1  [get_ports {sum[5]}]
set_load -pin_load -max  1  [get_ports {sum[4]}]
set_load -pin_load -min  1  [get_ports {sum[4]}]
set_load -pin_load -max  1  [get_ports {sum[3]}]
set_load -pin_load -min  1  [get_ports {sum[3]}]
set_load -pin_load -max  1  [get_ports {sum[2]}]
set_load -pin_load -min  1  [get_ports {sum[2]}]
set_load -pin_load -max  1  [get_ports {sum[1]}]
set_load -pin_load -min  1  [get_ports {sum[1]}]
set_load -pin_load -max  1  [get_ports {sum[0]}]
set_load -pin_load -min  1  [get_ports {sum[0]}]
set_load -pin_load -max  1  [get_ports {cout}]
set_load -pin_load -min  1  [get_ports {cout}]
set_input_delay -add_delay 1 -clock [get_clocks {clk}] [get_ports {b[31]}]
set_input_delay -add_delay 1 -clock [get_clocks {clk}] [get_ports {b[24]}]
set_input_delay -add_delay 1 -clock [get_clocks {clk}] [get_ports {b[17]}]
set_input_delay -add_delay 1 -clock [get_clocks {clk}] [get_ports {b[4]}]
set_input_delay -add_delay 1 -clock [get_clocks {clk}] [get_ports {a[4]}]
set_input_delay -add_delay 1 -clock [get_clocks {clk}] [get_ports {a[31]}]
set_input_delay -add_delay 1 -clock [get_clocks {clk}] [get_ports {a[24]}]
set_input_delay -add_delay 1 -clock [get_clocks {clk}] [get_ports {a[17]}]
set_input_delay -add_delay 1 -clock [get_clocks {clk}] [get_ports {b[29]}]
set_input_delay -add_delay 1 -clock [get_clocks {clk}] [get_ports {b[9]}]
set_input_delay -add_delay 1 -clock [get_clocks {clk}] [get_ports {a[9]}]
set_input_delay -add_delay 1 -clock [get_clocks {clk}] [get_ports {b[20]}]
set_input_delay -add_delay 1 -clock [get_clocks {clk}] [get_ports {b[13]}]
set_input_delay -add_delay 1 -clock [get_clocks {clk}] [get_ports {b[0]}]
set_input_delay -add_delay 1 -clock [get_clocks {clk}] [get_ports {a[0]}]
set_input_delay -add_delay 1 -clock [get_clocks {clk}] [get_ports {a[29]}]
set_input_delay -add_delay 1 -clock [get_clocks {clk}] [get_ports {a[20]}]
set_input_delay -add_delay 1 -clock [get_clocks {clk}] [get_ports {a[13]}]
set_input_delay -add_delay 1 -clock [get_clocks {clk}] [get_ports {b[25]}]
set_input_delay -add_delay 1 -clock [get_clocks {clk}] [get_ports {b[18]}]
set_input_delay -add_delay 1 -clock [get_clocks {clk}] [get_ports {b[5]}]
set_input_delay -add_delay 1 -clock [get_clocks {clk}] [get_ports {a[5]}]
set_input_delay -add_delay 1 -clock [get_clocks {clk}] [get_ports {a[25]}]
set_input_delay -add_delay 1 -clock [get_clocks {clk}] [get_ports {a[18]}]
set_input_delay -add_delay 1 -clock [get_clocks {clk}] [get_ports {b[21]}]
set_input_delay -add_delay 1 -clock [get_clocks {clk}] [get_ports {b[14]}]
set_input_delay -add_delay 1 -clock [get_clocks {clk}] [get_ports {b[1]}]
set_input_delay -add_delay 1 -clock [get_clocks {clk}] [get_ports {a[1]}]
set_input_delay -add_delay 1 -clock [get_clocks {clk}] [get_ports {a[21]}]
set_input_delay -add_delay 1 -clock [get_clocks {clk}] [get_ports {a[14]}]
set_input_delay -add_delay 1 -clock [get_clocks {clk}] [get_ports {b[26]}]
set_input_delay -add_delay 1 -clock [get_clocks {clk}] [get_ports {b[19]}]
set_input_delay -add_delay 1 -clock [get_clocks {clk}] [get_ports {b[6]}]
set_input_delay -add_delay 1 -clock [get_clocks {clk}] [get_ports {a[6]}]
set_input_delay -add_delay 1 -clock [get_clocks {clk}] [get_ports {b[10]}]
set_input_delay -add_delay 1 -clock [get_clocks {clk}] [get_ports {a[26]}]
set_input_delay -add_delay 1 -clock [get_clocks {clk}] [get_ports {a[19]}]
set_input_delay -add_delay 1 -clock [get_clocks {clk}] [get_ports {a[10]}]
set_input_delay -add_delay 1 -clock [get_clocks {clk}] [get_ports {cin}]
set_input_delay -add_delay 1 -clock [get_clocks {clk}] [get_ports {b[22]}]
set_input_delay -add_delay 1 -clock [get_clocks {clk}] [get_ports {b[15]}]
set_input_delay -add_delay 1 -clock [get_clocks {clk}] [get_ports {b[2]}]
set_input_delay -add_delay 1 -clock [get_clocks {clk}] [get_ports {a[2]}]
set_input_delay -add_delay 1 -clock [get_clocks {clk}] [get_ports {a[22]}]
set_input_delay -add_delay 1 -clock [get_clocks {clk}] [get_ports {a[15]}]
set_input_delay -add_delay 1 -clock [get_clocks {clk}] [get_ports {b[27]}]
set_input_delay -add_delay 1 -clock [get_clocks {clk}] [get_ports {b[7]}]
set_input_delay -add_delay 1 -clock [get_clocks {clk}] [get_ports {a[7]}]
set_input_delay -add_delay 1 -clock [get_clocks {clk}] [get_ports {b[11]}]
set_input_delay -add_delay 1 -clock [get_clocks {clk}] [get_ports {a[27]}]
set_input_delay -add_delay 1 -clock [get_clocks {clk}] [get_ports {a[11]}]
set_input_delay -add_delay 1 -clock [get_clocks {clk}] [get_ports {b[30]}]
set_input_delay -add_delay 1 -clock [get_clocks {clk}] [get_ports {b[23]}]
set_input_delay -add_delay 1 -clock [get_clocks {clk}] [get_ports {b[16]}]
set_input_delay -add_delay 1 -clock [get_clocks {clk}] [get_ports {b[3]}]
set_input_delay -add_delay 1 -clock [get_clocks {clk}] [get_ports {a[3]}]
set_input_delay -add_delay 1 -clock [get_clocks {clk}] [get_ports {a[30]}]
set_input_delay -add_delay 1 -clock [get_clocks {clk}] [get_ports {a[23]}]
set_input_delay -add_delay 1 -clock [get_clocks {clk}] [get_ports {a[16]}]
set_input_delay -add_delay 1 -clock [get_clocks {clk}] [get_ports {b[28]}]
set_input_delay -add_delay 1 -clock [get_clocks {clk}] [get_ports {b[8]}]
set_input_delay -add_delay 1 -clock [get_clocks {clk}] [get_ports {a[8]}]
set_input_delay -add_delay 1 -clock [get_clocks {clk}] [get_ports {b[12]}]
set_input_delay -add_delay 1 -clock [get_clocks {clk}] [get_ports {a[28]}]
set_input_delay -add_delay 1 -clock [get_clocks {clk}] [get_ports {a[12]}]
set_output_delay -add_delay 1 -clock [get_clocks {clk}] [get_ports {sum[9]}]
set_output_delay -add_delay 1 -clock [get_clocks {clk}] [get_ports {sum[28]}]
set_output_delay -add_delay 1 -clock [get_clocks {clk}] [get_ports {sum[7]}]
set_output_delay -add_delay 1 -clock [get_clocks {clk}] [get_ports {sum[26]}]
set_output_delay -add_delay 1 -clock [get_clocks {clk}] [get_ports {sum[19]}]
set_output_delay -add_delay 1 -clock [get_clocks {clk}] [get_ports {sum[5]}]
set_output_delay -add_delay 1 -clock [get_clocks {clk}] [get_ports {cout}]
set_output_delay -add_delay 1 -clock [get_clocks {clk}] [get_ports {sum[31]}]
set_output_delay -add_delay 1 -clock [get_clocks {clk}] [get_ports {sum[24]}]
set_output_delay -add_delay 1 -clock [get_clocks {clk}] [get_ports {sum[17]}]
set_output_delay -add_delay 1 -clock [get_clocks {clk}] [get_ports {sum[3]}]
set_output_delay -add_delay 1 -clock [get_clocks {clk}] [get_ports {sum[22]}]
set_output_delay -add_delay 1 -clock [get_clocks {clk}] [get_ports {sum[15]}]
set_output_delay -add_delay 1 -clock [get_clocks {clk}] [get_ports {sum[1]}]
set_output_delay -add_delay 1 -clock [get_clocks {clk}] [get_ports {sum[20]}]
set_output_delay -add_delay 1 -clock [get_clocks {clk}] [get_ports {sum[13]}]
set_output_delay -add_delay 1 -clock [get_clocks {clk}] [get_ports {sum[11]}]
set_output_delay -add_delay 1 -clock [get_clocks {clk}] [get_ports {sum[29]}]
set_output_delay -add_delay 1 -clock [get_clocks {clk}] [get_ports {sum[8]}]
set_output_delay -add_delay 1 -clock [get_clocks {clk}] [get_ports {sum[27]}]
set_output_delay -add_delay 1 -clock [get_clocks {clk}] [get_ports {sum[6]}]
set_output_delay -add_delay 1 -clock [get_clocks {clk}] [get_ports {sum[25]}]
set_output_delay -add_delay 1 -clock [get_clocks {clk}] [get_ports {sum[18]}]
set_output_delay -add_delay 1 -clock [get_clocks {clk}] [get_ports {sum[4]}]
set_output_delay -add_delay 1 -clock [get_clocks {clk}] [get_ports {sum[30]}]
set_output_delay -add_delay 1 -clock [get_clocks {clk}] [get_ports {sum[23]}]
set_output_delay -add_delay 1 -clock [get_clocks {clk}] [get_ports {sum[16]}]
set_output_delay -add_delay 1 -clock [get_clocks {clk}] [get_ports {sum[2]}]
set_output_delay -add_delay 1 -clock [get_clocks {clk}] [get_ports {sum[21]}]
set_output_delay -add_delay 1 -clock [get_clocks {clk}] [get_ports {sum[14]}]
set_output_delay -add_delay 1 -clock [get_clocks {clk}] [get_ports {sum[0]}]
set_output_delay -add_delay 1 -clock [get_clocks {clk}] [get_ports {sum[12]}]
set_output_delay -add_delay 1 -clock [get_clocks {clk}] [get_ports {sum[10]}]
